Enums/ВидыРасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыРасчетовПоДоговорам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыВВалютеРегламентированногоУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыВИностраннойВалюте</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РазделыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РазделыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОценкаМПЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЗадолженности</Name>
			<Comment>Виды задолженности: дебиторская, кредиторская</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
					<Comment>Дебиторская</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
					<Comment>Кредиторская</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НаправленияДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>НаправленияДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбытие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствКассеККМ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыПоВедомостям</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыРаботнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствРозничнаяВыручка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПодотчетником</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхДенежныхСредствВБанке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РасчетыВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РасчетыВозврат</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийСписаниеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеБезналичныхДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоПлатежнымКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоБанковскимКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеСредствОтФСС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийППИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийППИсходящее</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗПСотруднику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/БухгалтерскийУчетРасчетовСКонтрагентами/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПРОВЕДЕНИЯ ДОКУМЕНТОВ ПО РЕГЛ. ВЗАИМОРАСЧЕТАМ (НДС)

//Функция возвращает вид расчетов по договору
// Параметры
//		ДоговорКонтрагента 				- СправочникСсылка.ДоговорыКонтраентов
//		ВалютаРегламентированногоУчета 	- СправочникСсылка.Валюты
//
// Возвращаемое значение
//      ПеречилениеСсылка.ВидыРасчетовПоДоговорам
//
Функция ОпределениеВидаРасчетовПоПараметрамДоговора(ДоговорКонтрагента,ВалютаРегламентированногоУчета) Экспорт
	
	Если НЕ ДоговорКонтрагента.Внешнеэкономический Тогда
		ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВВалютеРегламентированногоУчета;

	Иначе
		ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВИностраннойВалюте;

	Конецесли;

	Возврат ВидРасчетовПоДоговору;

КонецФункции

// Выполняет приход/расход (возврат) денег по платежным документам при расчетах с контрагентами
//
// Параметры
// ОбъектСсылка    - ДокументОбъект или ДокументСсылка - Документ для которого выполяентся операция.
// РежимПроведения - РежимПроведенияДокумента- Режим проведения документа, для регламентной процедуры - неопределено
// РасчетыВВалюте  - Булево                  - Признак расчетов в валюте
// СчетКт          - ПланСчетов.Хозрасчетный - корреспондирующий счет
//
Функция ДвижениеДенег(ДокументОбъект,СтруктураШапкиДокумента,Знач ОпределятьСостояниеРасчетов=Ложь,Отказ,Заголовок,БазовоеСодержаниеПроводки="",НомерЖурнала="", РеестрПлатежей = Неопределено, ПереворачиватьОтрицательныеПроводки = Ложь) Экспорт

	Перем ВидОперации;
	Если ОпределятьСостояниеРасчетов и не ОбщегоНазначения.ПроводитьДокументПоРазделуУчета(СтруктураШапкиДокумента.Организация, Перечисления.РазделыУчета.РасчетыСКонтрагентами, СтруктураШапкиДокумента.Дата) Тогда
		//Оперативное определение состояния расчетов не требуется.
		ОпределятьСостояниеРасчетов = Ложь;
	КонецЕсли; 
	
	//Подготовим реестр платежей по данным документа
	Если РеестрПлатежей = Неопределено Тогда
		РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
	КонецЕсли; 

	Если РеестрПлатежей.Количество() = 0 тогда
		//Расчеты отсутствуют
		Возврат Истина;
	КонецЕсли;
	
	СтруктураШапкиДокумента.Свойство("ВидОперации", ВидОперации);

	//Получение основных данных документа для фильтра остатков
	Организация         = СтруктураШапкиДокумента.Организация;
	
	Если СтруктураШапкиДокумента.Свойство("ДатаОплаты") Тогда
		ДатаДока = СтруктураШапкиДокумента.ДатаОплаты;
	Иначе
		ДатаДока = СтруктураШапкиДокумента.Дата;
	КонецЕсли; 
	Если СтруктураШапкиДокумента.ВидДокумента = "КорректировкаДолга" Тогда
		НаправлениеДвижения = ?(СтруктураШапкиДокумента.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская,Перечисления.НаправленияДвижений.Поступление,Перечисления.НаправленияДвижений.Выбытие);
	Иначе	
		НаправлениеДвижения = БухгалтерскийУчетРасчетовСКонтрагентами.ОпределениеНаправленияДвиженияДляДокументаДвиженияДенежныхСредств(СтруктураШапкиДокумента.ВидДокумента, ВидОперации).Направление;
	КонецЕсли; 
	ЭтоВозврат          = СтруктураШапкиДокумента.ЭтоВозврат;
	
	//Таблица значений для занесения промежуточных расчетов
	РеестрПроводок = РеестрПлатежей.Скопировать();
	РеестрПроводок.Колонки.Добавить("РезультатРаспределения",Новый ОписаниеТипов("Булево"));

	Если ОпределятьСостояниеРасчетов тогда
		
		//Оценка текущего состояния расчетов по БУ для каждого счета из счетов оплаты в документе.
		РеестрПроводок.Очистить();
		
		//Для банковских документов дата движения может отличаться
		МоментДокумента = Новый МоментВремени(ДатаДока,СтруктураШапкиДокумента.Ссылка);
		
		ПлатежиСвернуто = РеестрПлатежей.Скопировать();
		ПлатежиСвернуто.Свернуть("Контрагент,ДоговорКонтрагента,Сделка,СчетОплаты,ВалютаВзаиморасчетов","СуммаВзаиморасчетов");
		
		РеестрЗадолженности = ПлатежиСвернуто.Скопировать();
		РеестрЗадолженности.Очистить();
		
		//Дополним реестр задолженностей необходимыми колонками
		//ТекущаяЗадолженность = ОбщегоНазначения.ПолучитьОстатокПоСчету(Организация,МоментДокумента,ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		ТекущаяЗадолженность = Новый ТаблицаЗначений;
		ТекущаяЗадолженность.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		ТекущаяЗадолженность.Колонки.Добавить("Субконто1");
		ТекущаяЗадолженность.Колонки.Добавить("Субконто2");
		ТекущаяЗадолженность.Колонки.Добавить("Субконто3");
		ТекущаяЗадолженность.Колонки.Добавить("Валюта");
		ТекущаяЗадолженность.Колонки.Добавить("СуммаОстаток", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
		ТекущаяЗадолженность.Колонки.Добавить("ВалютнаяСуммаОстаток", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
		ОбщегоНазначения.ДополнитьКолонкиТаблицыЗначений(РеестрЗадолженности,ТекущаяЗадолженность);
		ОбщегоНазначения.ДополнитьКолонкиТаблицыЗначений(РеестрПроводок,ТекущаяЗадолженность);
		
		//Получим таблицу задолженностей по данным бух. учета
		Для каждого ХарактеристикиПлатежа из ПлатежиСвернуто цикл
			
			//Для пустой оплаты не нужны остатки
			Если ХарактеристикиПлатежа.СуммаВзаиморасчетов=0 тогда
				Продолжить;
			КонецЕсли;

			СчетОплаты = ХарактеристикиПлатежа.СчетОплаты;
			Если НЕ ЗначениеЗаполнено(СчетОплаты) тогда
				//Если счет оплаты не заполнен (возможно при возврате), остатки оценивать не надо.
				Продолжить;
			КонецЕсли;

			//Определяем режим получения остатков
			ПолучитьОстаткиВВалюте = НЕ(ХарактеристикиПлатежа.ВалютаВзаиморасчетов = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета) 
				                     И ХарактеристикиПлатежа.СчетОплаты.Валютный;

			//Определяем фильтр по аналитике
			АналитикаСчета = Новый массив(3);

			Для каждого Субконто из ХарактеристикиПлатежа.СчетОплаты.ВидыСубконто Цикл

				Если Субконто.ВидСубконто =  ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты тогда
					АналитикаСчета[Субконто.НомерСтроки-1] = ХарактеристикиПлатежа.Контрагент;
				ИначеЕсли Субконто.ВидСубконто =  ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры тогда
					АналитикаСчета[Субконто.НомерСтроки-1] = ХарактеристикиПлатежа.ДоговорКонтрагента;
				ИначеЕсли Субконто.ВидСубконто =  ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами тогда
					АналитикаСчета[Субконто.НомерСтроки-1] = ХарактеристикиПлатежа.Сделка;
				КонецЕсли;

			КонецЦикла;

			УсловиеВалюта = Неопределено;

			Если ПолучитьОстаткиВВалюте Тогда
				УсловиеВалюта = ХарактеристикиПлатежа.ВалютаВзаиморасчетов;
			КонецЕсли;

			ЗнакФильтрПоОстаткам = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление,1,-1);

			НомерСубконтоРасчетныеДокументы = 0;

			Если НЕ СчетОплаты.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто")=Неопределено тогда
				НомерСубконтоРасчетныеДокументы = СчетОплаты.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто").НомерСтроки;
			КонецЕсли;

			Если Не(НомерСубконтоРасчетныеДокументы=0) 
				и ХарактеристикиПлатежа.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл
				и НЕ ЗначениеЗаполнено(ХарактеристикиПлатежа.Сделка) тогда
				Продолжить;

			КонецЕсли;

			ТекущаяЗадолженность = 	ОбщегоНазначения.ПолучитьОстатокПоСчету(Организация,МоментДокумента,СчетОплаты,УсловиеВалюта ,АналитикаСчета[0],АналитикаСчета[1],АналитикаСчета[2],ЗнакФильтрПоОстаткам);

			Если не НомерСубконтоРасчетныеДокументы = 0 тогда
				УправлениеВзаиморасчетами.УпорядочитьТаблицуПоДокументу(ТекущаяЗадолженность,"Субконто" + НомерСубконтоРасчетныеДокументы);
			КонецЕсли;

			Если ТекущаяЗадолженность.Количество() > 0 тогда

				Для каждого СтрокаЗадолженности из ТекущаяЗадолженность цикл

					СтрокаРеестра = РеестрЗадолженности.Добавить();

					Для каждого Колонка из ПлатежиСвернуто.Колонки Цикл
						СтрокаРеестра[Колонка.Имя] = ХарактеристикиПлатежа[Колонка.Имя];
					КонецЦикла;

					Для каждого Колонка из ТекущаяЗадолженность.Колонки Цикл
						СтрокаРеестра[Колонка.Имя] = СтрокаЗадолженности[Колонка.Имя];
					КонецЦикла;

				КонецЦикла;

			КонецЕсли;

		КонецЦикла;

		СуммовыеРазницыПоДокументам = Неопределено;

		УправлениеВзаиморасчетами.ФИФОПоРасчетам(РеестрПроводок, РеестрПлатежей,РеестрЗадолженности,СтруктураШапкиДокумента,"СчетОплаты", СуммовыеРазницыПоДокументам, НаправлениеДвижения, Заголовок);	

	КонецЕсли;

	ПроводкиБУ = ДокументОбъект.Движения.Хозрасчетный;

	БазовыйСуфиксСчетаРасчетов = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление,"Кт","Дт");
	БазовыйСуфиксКоррСчета     = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление,"Дт","Кт");
	
	//Проводки по результатам распределения
	Для каждого РезультатРаспределения из РеестрПроводок Цикл

		Если РезультатРаспределения.ВалютнаяСумма=0 и РезультатРаспределения.ГривневаяСумма=0 и РезультатРаспределения.СуммаВзаиморасчетов=0 тогда
			Продолжить;
		КонецЕслИ;
		
		Если ПереворачиватьОтрицательныеПроводки Тогда
			СуфиксСчетаРасчетов = ?(РезультатРаспределения.ГривневаяСумма>0,БазовыйСуфиксСчетаРасчетов,БазовыйСуфиксКоррСчета);
			СуфиксКоррСчета     = ?(РезультатРаспределения.ГривневаяСумма>0,БазовыйСуфиксКоррСчета,БазовыйСуфиксСчетаРасчетов);
		Иначе
			СуфиксСчетаРасчетов = БазовыйСуфиксСчетаРасчетов;
			СуфиксКоррСчета     = БазовыйСуфиксКоррСчета;
		КонецЕсли; 

		Если РезультатРаспределения.РезультатРаспределения тогда

			
			Если не (РеестрПроводок.Колонки.Найти("СодержаниеПроводки") = Неопределено) и ЗначениеЗаполнено(РезультатРаспределения.СодержаниеПроводки) тогда
				СодержаниеПроводки = РезультатРаспределения.СодержаниеПроводки;
			ИначеЕсли ЗначениеЗаполнено(БазовоеСодержаниеПроводки) тогда
				СодержаниеПроводки = БазовоеСодержаниеПроводки;
			Иначе
				СодержаниеПроводки  = ?(ЭтоВозврат,?(ТипЗнч(РезультатРаспределения.Сделка) =Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"),"Возврат оплаты","Возврат аванса"),"Оплата");
			КонецЕсли;

			СчетРасчетов = ?(НЕ ЗначениеЗаполнено(РезультатРаспределения.СчетОплаты),РезультатРаспределения.СчетАванса,РезультатРаспределения.СчетОплаты);

		Иначе

			Если не (РеестрПроводок.Колонки.Найти("СодержаниеПроводки") = Неопределено) и ЗначениеЗаполнено(РезультатРаспределения.СодержаниеПроводки) тогда
				СодержаниеПроводки = РезультатРаспределения.СодержаниеПроводки;
			ИначеЕсли ЗначениеЗаполнено(БазовоеСодержаниеПроводки) тогда
				СодержаниеПроводки = БазовоеСодержаниеПроводки;
			Иначе
				СодержаниеПроводки  = ?(ЭтоВозврат,"Возврат","Оплата (аванс)");
			КонецЕсли;

			СчетРасчетов = ?(НЕ ЗначениеЗаполнено(РезультатРаспределения.СчетАванса),РезультатРаспределения.СчетОплаты,РезультатРаспределения.СчетАванса);

		КонецЕслИ;

		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период       = ДатаДока;
		Проводка.Организация  = Организация;
		Проводка.Содержание   = СодержаниеПроводки;
		Проводка.НомерЖурнала = НомерЖурнала;

		Проводка["Счет"+СуфиксСчетаРасчетов]= СчетРасчетов;

		Если РезультатРаспределения.РезультатРаспределения тогда

			Для НомерСубконто = 1 по 3 Цикл
				ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксСчетаРасчетов],Проводка["Субконто"+СуфиксСчетаРасчетов],НомерСубконто,РезультатРаспределения["Субконто"+НомерСубконто]);
			КонецЦикла;

		Иначе
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксСчетаРасчетов],Проводка["Субконто"+СуфиксСчетаРасчетов],"Контрагенты",РезультатРаспределения.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксСчетаРасчетов],Проводка["Субконто"+СуфиксСчетаРасчетов],"Договоры",РезультатРаспределения.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксСчетаРасчетов],Проводка["Субконто"+СуфиксСчетаРасчетов],"ДокументыРасчетовСКонтрагентами",?(ОпределятьСостояниеРасчетов,
																																										УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(РезультатРаспределения, СтруктураШапкиДокумента.Ссылка,РезультатРаспределения.Сделка),
																																										РезультатРаспределения.Сделка));
		КонецЕслИ;

		Проводка["Счет"+СуфиксКоррСчета] = РезультатРаспределения.КоррСчет;

		Для НомерСубконто = 1 по 3 Цикл
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксКоррСчета],Проводка["Субконто"+СуфиксКоррСчета],НомерСубконто,РезультатРаспределения["КоррСубконто"+НомерСубконто]);
		КонецЦикла;
        ЗнакСуммы = ?(ПереворачиватьОтрицательныеПроводки и РезультатРаспределения.ГривневаяСумма<0,-1,1);
		
		Проводка.Сумма = РезультатРаспределения.ГривневаяСумма*ЗнакСуммы;

		Если Проводка["Счет" + СуфиксКоррСчета].Валютный тогда
			Проводка["Валюта" + СуфиксКоррСчета]        = СтруктураШапкиДокумента.ВалютаДокумента;
			Проводка["ВалютнаяСумма" + СуфиксКоррСчета] = РезультатРаспределения .ВалютнаяСумма*ЗнакСуммы;
		КонецЕсли;

		Если Проводка["Счет" + СуфиксСчетаРасчетов].Валютный Тогда
			Проводка["Валюта" + СуфиксСчетаРасчетов]        = РезультатРаспределения.ВалютаВзаиморасчетов;
			Проводка["ВалютнаяСумма" + СуфиксСчетаРасчетов] = РезультатРаспределения.СуммаВзаиморасчетов*ЗнакСуммы;
		КонецЕсли;

		Если (ДатаДока < глЗначениеПеременной("ДатаНКУ2015")) И (НЕ РеестрПлатежей.Колонки.Найти("НалоговоеНазначение") = Неопределено) Тогда
			
			Проводка["НалоговоеНазначение" + СуфиксКоррСчета] = РезультатРаспределения.НалоговоеНазначение;
			
			Если НЕ РезультатРаспределения.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка["СуммаНУ" + СуфиксКоррСчета] = Проводка.Сумма;	
			КонецЕсли;
			
			Если НЕ РеестрПлатежей.Колонки.Найти("НеОтноситьНаЗатратыПоНУ") = Неопределено
				И РезультатРаспределения.НеОтноситьНаЗатратыПоНУ = Истина Тогда
				Проводка["СуммаНУ" + СуфиксКоррСчета] = 0;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	
	Возврат Истина;

КонецФункции // ДвижениеДенег()

//Яковлев Руслан 
Функция ДвижениеДенегУпр(ДокументОбъект,СтруктураШапкиДокумента,Знач ОпределятьСостояниеРасчетов=Ложь,Отказ,Заголовок,БазовоеСодержаниеПроводки="",НомерЖурнала="", РеестрПлатежей = Неопределено, ПереворачиватьОтрицательныеПроводки = Ложь) Экспорт

	Перем ВидОперации;
	Если ОпределятьСостояниеРасчетов и не ОбщегоНазначения.ПроводитьДокументПоРазделуУчета(СтруктураШапкиДокумента.Организация, Перечисления.РазделыУчета.РасчетыСКонтрагентами, СтруктураШапкиДокумента.Дата) Тогда
		//Оперативное определение состояния расчетов не требуется.
		ОпределятьСостояниеРасчетов = Ложь;
	КонецЕсли; 
	
	//Подготовим реестр платежей по данным документа
	Если РеестрПлатежей = Неопределено Тогда
		РеестрПлатежей = УправлениеДенежнымиСредствами.ПодготовитьТаблицуОплат(СтруктураШапкиДокумента);
	КонецЕсли; 

	Если РеестрПлатежей.Количество() = 0 тогда
		//Расчеты отсутствуют
		Возврат Истина;
	КонецЕсли;
	
	
	Для Каждого СтрокаРеестра из РеестрПлатежей Цикл 
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УпрРасходныйКассовыйОрдер") Тогда 
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику Тогда 
				Если ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
					СтрокаРеестра.СчетАванса   = ?(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), ПланыСчетов.Хозрасчетный.НайтиПоКоду("631"),ДокументОбъект.СчетУчетаРасчетовСКонтрагентом); 
					СтрокаРеестра.СчетОплаты   = ?(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), ПланыСчетов.Хозрасчетный.НайтиПоКоду("631"),ДокументОбъект.СчетУчетаРасчетовСКонтрагентом);			
					
										
				Иначе 
					СтрокаРеестра.СчетАванса   = ?(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), ПланыСчетов.Хозрасчетный.НайтиПоКоду("632"),ДокументОбъект.СчетУчетаРасчетовСКонтрагентом); 
					СтрокаРеестра.СчетОплаты   = ?(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), ПланыСчетов.Хозрасчетный.НайтиПоКоду("632"),ДокументОбъект.СчетУчетаРасчетовСКонтрагентом);
						
				КонецЕсли;
			ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю Тогда 
				Если ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
					СтрокаРеестра.СчетАванса   = ?(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), ПланыСчетов.Хозрасчетный.НайтиПоКоду("361"),ДокументОбъект.СчетУчетаРасчетовСКонтрагентом); ; 
					СтрокаРеестра.СчетОплаты   = ?(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), ПланыСчетов.Хозрасчетный.НайтиПоКоду("361"),ДокументОбъект.СчетУчетаРасчетовСКонтрагентом); ;			
					//СтрокаРеестра.Субконто2    = ДокументОбъект.Субконто2;	
				Иначе 
					СтрокаРеестра.СчетАванса   = ?(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), ПланыСчетов.Хозрасчетный.НайтиПоКоду("362"),ДокументОбъект.СчетУчетаРасчетовСКонтрагентом);					 
					СтрокаРеестра.СчетОплаты   = ?(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), ПланыСчетов.Хозрасчетный.НайтиПоКоду("362"),ДокументОбъект.СчетУчетаРасчетовСКонтрагентом); ;
					//СтрокаРеестра.Субконто2    = ДокументОбъект.Субконто2;	
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УпрПриходныйКассовыйОрдер") Тогда 
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда 
				Если ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
					СтрокаРеестра.СчетАванса  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("361"); 
					СтрокаРеестра.СчетОплаты   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("361");			
				Иначе 
					СтрокаРеестра.СчетАванса  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("362"); 
					СтрокаРеестра.СчетОплаты   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("362");
				КонецЕсли;
			ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком Тогда 
				Если ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
					СтрокаРеестра.СчетАванса  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("631"); 
					СтрокаРеестра.СчетОплаты   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("631");			
				Иначе 
					СтрокаРеестра.СчетАванса  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("632"); 
					СтрокаРеестра.СчетОплаты   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("632");
				КонецЕсли;
			ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда
				 Если ДокументОбъект.КассаОтправитель.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
					СтрокаРеестра.СчетАванса  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("301"); 
					СтрокаРеестра.СчетОплаты   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("301");			
				Иначе 
					СтрокаРеестра.СчетАванса  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("302"); 
					СтрокаРеестра.СчетОплаты   = ПланыСчетов.Хозрасчетный.НайтиПоКоду("302");
				КонецЕсли;
	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	СтруктураШапкиДокумента.Свойство("ВидОперации", ВидОперации);

	//Получение основных данных документа для фильтра остатков
	Организация         = СтруктураШапкиДокумента.Организация;
	
	Если СтруктураШапкиДокумента.Свойство("ДатаОплаты") Тогда
		ДатаДока = СтруктураШапкиДокумента.ДатаОплаты;
	Иначе
		ДатаДока = СтруктураШапкиДокумента.Дата;
	КонецЕсли; 
	Если СтруктураШапкиДокумента.ВидДокумента = "КорректировкаДолга" Тогда
		НаправлениеДвижения = ?(СтруктураШапкиДокумента.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская,Перечисления.НаправленияДвижений.Поступление,Перечисления.НаправленияДвижений.Выбытие);
	Иначе	
		НаправлениеДвижения = БухгалтерскийУчетРасчетовСКонтрагентами.ОпределениеНаправленияДвиженияДляДокументаДвиженияДенежныхСредств(СтруктураШапкиДокумента.ВидДокумента, ВидОперации).Направление;
	КонецЕсли; 
	ЭтоВозврат          = СтруктураШапкиДокумента.ЭтоВозврат;
	
	//Таблица значений для занесения промежуточных расчетов
	РеестрПроводок = РеестрПлатежей.Скопировать();
	РеестрПроводок.Колонки.Добавить("РезультатРаспределения",Новый ОписаниеТипов("Булево"));

	Если Ложь тогда
		
		//Оценка текущего состояния расчетов по БУ для каждого счета из счетов оплаты в документе.
		РеестрПроводок.Очистить();
		
		//Для банковских документов дата движения может отличаться
		МоментДокумента = Новый МоментВремени(ДатаДока,СтруктураШапкиДокумента.Ссылка);
		
		ПлатежиСвернуто = РеестрПлатежей.Скопировать();
		ПлатежиСвернуто.Свернуть("Контрагент,ДоговорКонтрагента,Сделка,СчетОплаты,ВалютаВзаиморасчетов","СуммаВзаиморасчетов");
		
		РеестрЗадолженности = ПлатежиСвернуто.Скопировать();
		РеестрЗадолженности.Очистить();
		
		//Дополним реестр задолженностей необходимыми колонками
		//ТекущаяЗадолженность = ОбщегоНазначения.ПолучитьОстатокПоСчету(Организация,МоментДокумента,ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		ТекущаяЗадолженность = Новый ТаблицаЗначений;
		ТекущаяЗадолженность.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		ТекущаяЗадолженность.Колонки.Добавить("Субконто1");
		ТекущаяЗадолженность.Колонки.Добавить("Субконто2");
		ТекущаяЗадолженность.Колонки.Добавить("Субконто3");
		ТекущаяЗадолженность.Колонки.Добавить("Валюта");
		ТекущаяЗадолженность.Колонки.Добавить("СуммаОстаток", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
		ТекущаяЗадолженность.Колонки.Добавить("ВалютнаяСуммаОстаток", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
		ОбщегоНазначения.ДополнитьКолонкиТаблицыЗначений(РеестрЗадолженности,ТекущаяЗадолженность);
		ОбщегоНазначения.ДополнитьКолонкиТаблицыЗначений(РеестрПроводок,ТекущаяЗадолженность);
		
		//Получим таблицу задолженностей по данным бух. учета
		Для каждого ХарактеристикиПлатежа из ПлатежиСвернуто цикл
			
			//Для пустой оплаты не нужны остатки
			Если ХарактеристикиПлатежа.СуммаВзаиморасчетов=0 тогда
				Продолжить;
			КонецЕсли;

			СчетОплаты = ХарактеристикиПлатежа.СчетОплаты;
			Если НЕ ЗначениеЗаполнено(СчетОплаты) тогда
				//Если счет оплаты не заполнен (возможно при возврате), остатки оценивать не надо.
				Продолжить;
			КонецЕсли;

			//Определяем режим получения остатков
			ПолучитьОстаткиВВалюте = НЕ(ХарактеристикиПлатежа.ВалютаВзаиморасчетов = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета) 
				                     И ХарактеристикиПлатежа.СчетОплаты.Валютный;

			//Определяем фильтр по аналитике
			АналитикаСчета = Новый массив(3);

			Для каждого Субконто из ХарактеристикиПлатежа.СчетОплаты.ВидыСубконто Цикл

				Если Субконто.ВидСубконто =  ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты тогда
					АналитикаСчета[Субконто.НомерСтроки-1] = ХарактеристикиПлатежа.Контрагент;
				ИначеЕсли Субконто.ВидСубконто =  ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры тогда
					АналитикаСчета[Субконто.НомерСтроки-1] = ХарактеристикиПлатежа.ДоговорКонтрагента;
				ИначеЕсли Субконто.ВидСубконто =  ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами тогда
					АналитикаСчета[Субконто.НомерСтроки-1] = ХарактеристикиПлатежа.Сделка;
				КонецЕсли;

			КонецЦикла;

			УсловиеВалюта = Неопределено;

			Если ПолучитьОстаткиВВалюте Тогда
				УсловиеВалюта = ХарактеристикиПлатежа.ВалютаВзаиморасчетов;
			КонецЕсли;

			ЗнакФильтрПоОстаткам = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление,1,-1);

			НомерСубконтоРасчетныеДокументы = 0;

			Если НЕ СчетОплаты.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто")=Неопределено тогда
				НомерСубконтоРасчетныеДокументы = СчетОплаты.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто").НомерСтроки;
			КонецЕсли;

			Если Не(НомерСубконтоРасчетныеДокументы=0) 
				и ХарактеристикиПлатежа.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл
				и НЕ ЗначениеЗаполнено(ХарактеристикиПлатежа.Сделка) тогда
				Продолжить;

			КонецЕсли;

			ТекущаяЗадолженность = 	ОбщегоНазначения.ПолучитьОстатокПоСчету(Организация,МоментДокумента,СчетОплаты,УсловиеВалюта ,АналитикаСчета[0],АналитикаСчета[1],АналитикаСчета[2],ЗнакФильтрПоОстаткам);

			Если не НомерСубконтоРасчетныеДокументы = 0 тогда
				УправлениеВзаиморасчетами.УпорядочитьТаблицуПоДокументу(ТекущаяЗадолженность,"Субконто" + НомерСубконтоРасчетныеДокументы);
			КонецЕсли;

			Если ТекущаяЗадолженность.Количество() > 0 тогда

				Для каждого СтрокаЗадолженности из ТекущаяЗадолженность цикл

					СтрокаРеестра = РеестрЗадолженности.Добавить();

					Для каждого Колонка из ПлатежиСвернуто.Колонки Цикл
						СтрокаРеестра[Колонка.Имя] = ХарактеристикиПлатежа[Колонка.Имя];
					КонецЦикла;

					Для каждого Колонка из ТекущаяЗадолженность.Колонки Цикл
						СтрокаРеестра[Колонка.Имя] = СтрокаЗадолженности[Колонка.Имя];
					КонецЦикла;

				КонецЦикла;

			КонецЕсли;

		КонецЦикла;

		СуммовыеРазницыПоДокументам = Неопределено;

		УправлениеВзаиморасчетами.ФИФОПоРасчетам(РеестрПроводок, РеестрПлатежей,РеестрЗадолженности,СтруктураШапкиДокумента,"СчетОплаты", СуммовыеРазницыПоДокументам, НаправлениеДвижения, Заголовок);	

	КонецЕсли;

	ПроводкиБУ = ДокументОбъект.Движения.Хозрасчетный;

	БазовыйСуфиксСчетаРасчетов = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление,"Кт","Дт");
	БазовыйСуфиксКоррСчета     = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление,"Дт","Кт");
	
	//Проводки по результатам распределения
	Для каждого РезультатРаспределения из РеестрПроводок Цикл

		Если РезультатРаспределения.ВалютнаяСумма=0 и РезультатРаспределения.ГривневаяСумма=0 и РезультатРаспределения.СуммаВзаиморасчетов=0 тогда
			Продолжить;
		КонецЕслИ;
		
		Если ПереворачиватьОтрицательныеПроводки Тогда
			СуфиксСчетаРасчетов = ?(РезультатРаспределения.ГривневаяСумма>0,БазовыйСуфиксСчетаРасчетов,БазовыйСуфиксКоррСчета);
			СуфиксКоррСчета     = ?(РезультатРаспределения.ГривневаяСумма>0,БазовыйСуфиксКоррСчета,БазовыйСуфиксСчетаРасчетов);
		Иначе
			СуфиксСчетаРасчетов = БазовыйСуфиксСчетаРасчетов;
			СуфиксКоррСчета     = БазовыйСуфиксКоррСчета;
		КонецЕсли; 

		Если РезультатРаспределения.РезультатРаспределения тогда

			
			Если не (РеестрПроводок.Колонки.Найти("СодержаниеПроводки") = Неопределено) и ЗначениеЗаполнено(РезультатРаспределения.СодержаниеПроводки) тогда
				СодержаниеПроводки = РезультатРаспределения.СодержаниеПроводки;
			ИначеЕсли ЗначениеЗаполнено(БазовоеСодержаниеПроводки) тогда
				СодержаниеПроводки = БазовоеСодержаниеПроводки;
			Иначе
				СодержаниеПроводки  = ?(ЭтоВозврат,?(ТипЗнч(РезультатРаспределения.Сделка) =Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"),"Возврат оплаты","Возврат аванса"),"Оплата");
			КонецЕсли;

			СчетРасчетов = ?(НЕ ЗначениеЗаполнено(РезультатРаспределения.СчетОплаты),РезультатРаспределения.СчетАванса,РезультатРаспределения.СчетОплаты);

		Иначе

			Если не (РеестрПроводок.Колонки.Найти("СодержаниеПроводки") = Неопределено) и ЗначениеЗаполнено(РезультатРаспределения.СодержаниеПроводки) тогда
				СодержаниеПроводки = РезультатРаспределения.СодержаниеПроводки;
			ИначеЕсли ЗначениеЗаполнено(БазовоеСодержаниеПроводки) тогда
				СодержаниеПроводки = БазовоеСодержаниеПроводки;
			Иначе
				СодержаниеПроводки  = ?(ЭтоВозврат,"Возврат","Оплата (аванс)");
			КонецЕсли;

			СчетРасчетов = ?(НЕ ЗначениеЗаполнено(РезультатРаспределения.СчетАванса),РезультатРаспределения.СчетОплаты,РезультатРаспределения.СчетАванса);

		КонецЕслИ;

		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период       = ДатаДока;
		Проводка.Организация  = Организация;
		Проводка.Содержание   = СодержаниеПроводки;
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Подразделение = ДокументОбъект.Подразделение;
		Проводка.Проект        = ?(ДокументОбъект.РасшифровкаПлатежа.Количество(),ДокументОбъект.РасшифровкаПлатежа[0].Проект,Справочники.Проекты.ПустаяСсылка());
		Проводка["Счет"+СуфиксСчетаРасчетов]= СчетРасчетов;

		Если РезультатРаспределения.РезультатРаспределения тогда

			Для НомерСубконто = 1 по 3 Цикл
				ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксСчетаРасчетов],Проводка["Субконто"+СуфиксСчетаРасчетов],НомерСубконто,РезультатРаспределения["Субконто"+НомерСубконто]);
			КонецЦикла;

		Иначе
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксСчетаРасчетов],Проводка["Субконто"+СуфиксСчетаРасчетов],"Контрагенты",РезультатРаспределения.Контрагент);
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксСчетаРасчетов],Проводка["Субконто"+СуфиксСчетаРасчетов],"Договоры",РезультатРаспределения.ДоговорКонтрагента);
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксСчетаРасчетов],Проводка["Субконто"+СуфиксСчетаРасчетов],"ДокументыРасчетовСКонтрагентами",?(ОпределятьСостояниеРасчетов,
																																										УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(РезультатРаспределения, СтруктураШапкиДокумента.Ссылка,РезультатРаспределения.Сделка),
																																										РезультатРаспределения.Сделка));
		КонецЕслИ;

		Проводка["Счет"+СуфиксКоррСчета] = РезультатРаспределения.КоррСчет;

		Для НомерСубконто = 1 по 3 Цикл
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет"+СуфиксКоррСчета],Проводка["Субконто"+СуфиксКоррСчета],НомерСубконто,РезультатРаспределения["КоррСубконто"+НомерСубконто]);
		КонецЦикла;
        ЗнакСуммы = ?(ПереворачиватьОтрицательныеПроводки и РезультатРаспределения.ГривневаяСумма<0,-1,1);
		
		Проводка.Сумма = РезультатРаспределения.ГривневаяСумма*ЗнакСуммы;

		Если Проводка["Счет" + СуфиксКоррСчета].Валютный тогда
			Проводка["Валюта" + СуфиксКоррСчета]        = СтруктураШапкиДокумента.ВалютаДокумента;
			Проводка["ВалютнаяСумма" + СуфиксКоррСчета] = РезультатРаспределения .ВалютнаяСумма*ЗнакСуммы;
		КонецЕсли;

		Если Проводка["Счет" + СуфиксСчетаРасчетов].Валютный Тогда
			Проводка["Валюта" + СуфиксСчетаРасчетов]        = РезультатРаспределения.ВалютаВзаиморасчетов;
			Проводка["ВалютнаяСумма" + СуфиксСчетаРасчетов] = РезультатРаспределения.СуммаВзаиморасчетов*ЗнакСуммы;
		КонецЕсли;

		Если (ДатаДока < глЗначениеПеременной("ДатаНКУ2015")) И (НЕ РеестрПлатежей.Колонки.Найти("НалоговоеНазначение") = Неопределено) Тогда
			
			Проводка["НалоговоеНазначение" + СуфиксКоррСчета] = РезультатРаспределения.НалоговоеНазначение;
			
			Если НЕ РезультатРаспределения.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность Тогда
				Проводка["СуммаНУ" + СуфиксКоррСчета] = Проводка.Сумма;	
			КонецЕсли;
			
			Если НЕ РеестрПлатежей.Колонки.Найти("НеОтноситьНаЗатратыПоНУ") = Неопределено
				И РезультатРаспределения.НеОтноситьНаЗатратыПоНУ = Истина Тогда
				Проводка["СуммаНУ" + СуфиксКоррСчета] = 0;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	
	Возврат Истина;

КонецФункции // ДвижениеДенег()


Функция ОпределениеНаправленияДвиженияДляДокументаДвиженияДенежныхСредств(ВидДокумента,ВидОперации = Неопределено)Экспорт

	ВидДействийДокумента = Новый Структура("Направление,РасчетыВозврат");
	ВидыДокументовДДС    = Новый Соответствие();

	ВидДвиженияПоступление = Перечисления.НаправленияДвижений.Поступление;
	ВидДвиженияВыбытие     = Перечисления.НаправленияДвижений.Выбытие;
	
	ВидОперацииРасчет  = Перечисления.РасчетыВозврат.Расчеты;
	ВидОперацииВозврат = Перечисления.РасчетыВозврат.Возврат;
	
	ВидыДокументовДДС.Вставить("ПлатежноеПоручениеИсходящее"             , ВидДвиженияВыбытие);
	ВидыДокументовДДС.Вставить("ПлатежныйОрдерСписаниеДенежныхСредств"   , ВидДвиженияВыбытие);
	ВидыДокументовДДС.Вставить("РасходныйКассовыйОрдер"                  , ВидДвиженияВыбытие);
	ВидыДокументовДДС.Вставить("УпрРасходныйКассовыйОрдер"                  , ВидДвиженияВыбытие);
	ВидыДокументовДДС.Вставить("ПлатежноеПоручениеВходящее"              , ВидДвиженияПоступление);
	ВидыДокументовДДС.Вставить("ПлатежныйОрдерПоступлениеДенежныхСредств", ВидДвиженияПоступление);
	ВидыДокументовДДС.Вставить("ПриходныйКассовыйОрдер"                  , ВидДвиженияПоступление);
	ВидыДокументовДДС.Вставить("УпрПриходныйКассовыйОрдер"                  , ВидДвиженияПоступление);

	ВидыДокументовДДС.Вставить("АвансовыйОтчет"							 , ВидДвиженияВыбытие);
	ВидыДокументовДДС.Вставить("ОплатаОтПокупателяПлатежнойКартой"		 , ВидДвиженияПоступление);
	
	Если ТипЗнч(ВидДокумента) = Тип("Строка") Тогда
		// Получен непосредственно вид документа
		// Дополнительные действия не требуются
		
		ВидДействийДокумента.Вставить("Направление",ВидыДокументовДДС[ВидДокумента]);
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ВидДокумента)) Тогда
		// Получена ссылка на документ. Необходимо определить его вид.
		
		ТипСсылки = ТипЗнч(ВидДокумента);
	    Для каждого ТекущееЗначениеСоответсвия Из ВидыДокументовДДС Цикл
			Если ТипСсылки = Тип("ДокументСсылка."+ТекущееЗначениеСоответсвия.Ключ) Тогда
				ВидДействийДокумента.Вставить("Направление",ТекущееЗначениеСоответсвия.Значение);
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда

		//Определение вида операции
		РасчетВозвратПоВидуОпераций = Новый Соответствие();

		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ОплатаПоставщику                                                   , ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю                                   , ВидОперацииВозврат);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами                                        , ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником,ВидОперацииВозврат);
		
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ОплатаПокупателя                                                   , ВидОперацииРасчет);
        РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком                                  , ВидОперацииВозврат);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами		                                 , ВидОперацииРасчет);
		
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику                    , ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю    , ВидОперацииВозврат);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами         , ВидОперацииРасчет);
		
		
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя                 , ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком, ВидОперацииВозврат);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами		 , ВидОперацииРасчет);
		
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику                                           , ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю                           , ВидОперацииВозврат);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами								 ,ВидОперацииРасчет);
		
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя					 ,ВидОперацииРасчет);
		РасчетВозвратПоВидуОпераций.Вставить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю	 ,ВидОперацииВозврат);
		
		Если ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю Тогда
			ВидДействийДокумента.Вставить("Направление",ВидДвиженияВыбытие);
		КонецЕсли; 
			
		ВидДействийДокумента.Вставить("РасчетыВозврат", РасчетВозвратПоВидуОпераций[ВидОперации]);
		
	ИначеЕсли ВидДокумента="АвансовыйОтчет" тогда
		
		ВидДействийДокумента.Вставить("РасчетыВозврат", ВидОперацииРасчет);
		
	Конецесли;

	Возврат ВидДействийДокумента;

КонецФункции
